       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME1 PIC X(28).
       01 WS-NAME2 REDEFINES WS-NAME1.
           05 WS-NAME21 PIC X(6).
           05 FILLER PIC X.
           05 WS-NAME22 PIC X(10).
           05 FILLER PIC X.
           05 WS-NAME23 PIC X(10).

       PROCEDURE DIVISION.
       MOVE "Groupe Netfective Technology" TO WS-NAME1.
       DISPLAY "WELCOME TO : " WS-NAME1.
       DISPLAY "WHERE YOU FIND THE BEST " WS-NAME23 " ENTHOUSIASTS".

       STOP RUN.
